app/views/users/new.html.erb

      <%= label_tag 'username' %>
      <%= text_field_tag 'name', @user.create.username %>
---
INSERT INTO "users" DEFAULT VALUES RETURNING "id"

      <%= label_tag 'email' %>
      <%= text_area_tag 'email', @user.create.email %>
---
INSERT INTO "users" DEFAULT VALUES RETURNING "id"

      <%= label_tag 'bio' %>
      <%= text_field_tag 'bio', @user.create.bio %>
---
INSERT INTO "users" DEFAULT VALUES RETURNING "id"