app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "bio") VALUES ($1, $2, $3) RETURNING "id"  [["username", "Bob"], ["email", "bob@aol.fr"], ["bio", "Bob Longeole\r\n"]]
INSERT INTO "users" ("username", "email", "bio") VALUES ($1, $2, $3) RETURNING "id"  [["username", ""], ["email", ""], ["bio", ""]]
---
  def create
=begin
    @user = User.create('username' => params[:username],
                        'email' => params[:email],
                        'bio' => params[:bio])
=end
    @user = User.create('username' => params.require(:user)[:username],
                    'email' => params.require(:user)[:email],
                    'bio' => params.require(:user)[:bio])